import pandas as pd

df = pd.read_excel('600177_雅戈尔.xlsx', index_col='交易日期')
df = df.sort_values(['交易日期'], ascending=True)  # 对数据进行排序,因为原始数据是按照时间降序排列的
# df.info()可以查看数据的概况，有无缺失值、数据类型等等

df['前收盘价'] = df['收盘价'].shift()  # 前收盘价是计算前一天的收盘价，以便后面计算其他的指标
df['涨跌幅'] = df['收盘价'] / df['前收盘价'] - 1  # 涨跌的比率
df['涨停价'] = df['前收盘价'] * 1.1  # 设置涨停以及跌停的阈值
df['跌停价'] = df['前收盘价'] * 0.9

df['资金曲线'] = (1 + df['涨跌幅']).cumprod()
# 涨跌幅+1得到的是一列值，加上括号可以作为一个序列处理，cumprod()代表累乘
# 资金曲线衡量的是股票的历史涨跌情况，初始为1
df.loc[:, '资金曲线'] = df['资金曲线'] / df['资金曲线'].iat[1]
# loc只是索引数据的标准方法，即.lov[行索引,列索引]=，就可以修改原表数据
# 然后iat[1]是为了从第二行开始取数据，因为我们的第一行有空值
df['收盘价_后复权'] = df['资金曲线'] * df['收盘价'].iat[1]
df['开盘价_后复权'] = df['开盘价'] / df['收盘价'] * df['收盘价_后复权']
df['最高价_后复权'] = df['最高价'] / df['收盘价'] * df['收盘价_后复权']
df['最低价_后复权'] = df['最低价'] / df['收盘价'] * df['收盘价_后复权']
df = df.drop(pd.to_datetime(['2010-04-28']), axis=0)  # 将第一行（有空值）删了
df.to_excel('600177.xlsx')  # 为了导出数据，需要安装一个openpyxl
# 后复权处理的意思是，以股票上市第一天为标准（记为1），计算今后的数据相对于基准日的变动
