import pandas as pd

dfs = pd.read_excel('600177.xlsx', index_col='交易日期')
dfs = dfs.sort_values(['交易日期'], ascending=True)


def ma_mark(dfr, n, m):
    '''
    :param dfr: 原始股票数据
    :param n: 统计短周期
    :param m: 统计长周期
    '''

    assert n < m, '统计短周期n必须小于统计长周期m'
    assert m < dfr.shape[0], '统计长周期m必须小于数据长度'
    # 制作数据备份
    df = dfr.copy()
    # 计算双均线
    df['MA%s' % n] = df['收盘价_后复权'].rolling(n).mean()
    df['MA%s' % m] = df['收盘价_后复权'].rolling(m).mean()
    # 买入信号标记
    df.loc[(df['MA%s' % n] > df['MA%s' % m]) &
           (df['MA%s' % n].shift(1) < df['MA%s' % m].shift(1)), '交易信号'] = 1
    # 卖出信号标记
    df.loc[(df['MA%s' % n] < df['MA%s' % m]) &
           (df['MA%s' % n].shift(1) > df['MA%s' % m].shift(1)), '交易信号'] = 0
    # 涨停无法买入标记
    df.loc[(df['收盘价'] >= df['涨停价']) &
           (df['交易信号'] == 1),
           '交易信号'] = None
    # 跌停无法卖出标记
    df.loc[(df['收盘价'] <= df['跌停价']) &
           (df['交易信号'] == 0),
           '交易信号'] = None
    # 持仓状态标记
    df['持仓状态'] = df['交易信号'].fillna(method='ffill').shift().fillna(0)
    # 返回数据
    return df


df_ma = ma_mark(dfs, 50, 200)

# 1.持仓分组标记
# 新建持仓分组列，直接赋值为index——交易日期
df_ma['持仓分组'] = df_ma.index
'''
由于持仓状态应该是买之前的状态都一样，买了之后卖出之前也应该是一样的，所以设置一下
先将持仓状态上一个等于下一个的持仓分组设成空值，再用向前填充的方法将持仓分组都
成最开始产生该状态的日期
'''
df_ma.loc[df_ma['持仓状态'] == df_ma['持仓状态'].shift(), '持仓分组'] = None
df_ma['持仓分组'].fillna(method='ffill', inplace=True)

# 2.策略涨跌幅及手续费计算
# 预计算策略涨跌幅，当持仓为0，策略涨跌幅也是0；持仓为1，策略涨跌幅=股票涨跌幅
df_ma['涨跌幅_策略'] = df_ma['涨跌幅'] * df_ma['持仓状态']
# 按手续费调整策略涨跌幅
'''
开仓买入手续费计算:
在持仓状态为1的每一组，首行即开仓买入，持仓状态刚刚从0到1，此时策略就要开始产生涨跌幅了。
假设我们开仓支付了0.1%的手续费，那么实际持仓的价值就只有99.9%，也就是只有99.9%的仓位发生了涨跌，
转换为 首行策略实际涨跌幅 = （1 + 股票涨跌幅）*（1 - 开仓手续费）- 1
平仓卖出手续费计算:
在持仓状态为1的每一组，最后一行收盘时平仓卖出，再下一行持仓状态就要从1变为0了，
此时策略涨跌幅就要被屏蔽掉了。在此之前，假设平仓也是0.1%手续费，那么最终变现的价值也就只有99.9%，
公式同样是 最后一行策略实际涨跌幅 = （1 + 股票涨跌幅）*（1 - 平仓手续费）- 1
'''
# 找出开仓组的首行（首行持仓状态为1，上一行是0），扣除手续费
df_ma.loc[(df_ma['持仓状态'] != 0) &
          (df_ma['持仓状态'] != df_ma['持仓状态'].shift()),
            '涨跌幅_策略'] = (1 + df_ma['涨跌幅_策略']) * (1 - 0.0008) - 1
# 找到开仓组的最后一行（最后一行持仓状态为1，下一行为0），扣除手续费
df_ma.loc[(df_ma['持仓状态'] != 0) &
          (df_ma['持仓状态'] != df_ma['持仓状态'].shift(-1)),
            '涨跌幅_策略'] = (1 + df_ma['涨跌幅_策略']) * (1 - 0.0008) -1
df_ma.to_excel('持仓分组标记.xlsx')
